ConfigFiles/Catalogs/ШаблоныПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныПроцесса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляОпределенногоТипаПредмета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Персональный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыШаблонаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредметаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецШаблонаПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданВладелецШаблона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьСозданиеНеПодчиненныхЗадачамШаблона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПереименованиеЗадачСозданныхПоШаблону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыСогласуемыхРесурсов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СогласуемыйРесурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСогласуемыхРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/ШаблоныПроцесса/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа  Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПредназначенДляОпределенногоТипаПредмета Тогда
		ЭтотОбъект.ТипПредмета = "";
		ЭтотОбъект.ТипПредметаПредставление = "";
	КонецЕсли;
	
	ЗаданВладелецШаблона = ЗначениеЗаполнено(ВладелецШаблона);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеРесурсов") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВидыСогласуемыхРесурсов.СогласуемыйРесурс
		|ПОМЕСТИТЬ ВидыСогласуемыхРесурсов
		|ИЗ
		|	&ВидыСогласуемыхРесурсов КАК ВидыСогласуемыхРесурсов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыСогласуемыхРесурсов.СогласуемыйРесурс КАК СогласуемыйРесурс,
		|	СУММА(1)                                  КАК КоличествоСогласуемогоРесурса
		|ИЗ
		|	ВидыСогласуемыхРесурсов КАК ВидыСогласуемыхРесурсов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыСогласуемыхРесурсов.СогласуемыйРесурс
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) > 1";
		
		Запрос.УстановитьПараметр("ВидыСогласуемыхРесурсов", ВидыСогласуемыхРесурсов.Выгрузить());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НайденныеСтроки = ВидыСогласуемыхРесурсов.НайтиСтроки(Новый Структура("СогласуемыйРесурс", Выборка.СогласуемыйРесурс));
			КоличествоНайденныхСтрок = НайденныеСтроки.Количество(); 
			Если КоличествоНайденныхСтрок > 1 Тогда
				СтрокКУдалению = КоличествоНайденныхСтрок - 1;
				УдаленоСтрок   = 0;
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Если УдаленоСтрок = СтрокКУдалению Тогда
						Прервать;
					КонецЕсли;
					
					ВидыСогласуемыхРесурсов.Удалить(НайденнаяСтрока);
					УдаленоСтрок = УдаленоСтрок + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтоГруппа Тогда
	
		МассивНепроверяемыхРеквизитов = Новый Массив;
		
		Если Не ПредназначенДляОпределенногоТипаПредмета Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТипПредмета");
			МассивНепроверяемыхРеквизитов.Добавить("ТипПредметаПредставление");
		КонецЕсли;
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
